Documents/НачислениеРезервовПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПИФ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧистыхАктивов</Name>
					<Comment>Не используется</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаВознаграждениеУправляющего</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаУслугиДепозитария</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНаПрочиеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачислениеРезервовПИФ/Ext/ManagerModule.bsl
Функция РассчитатьРезервы(ОбъектРасчета, ТекущаяСЧА = Неопределено) Экспорт

	ПараметрыРасчета = Новый Структура;
	
	ПараметрыРасчета.Вставить("Организация",					ОбъектРасчета.Организация);	
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ОбъектРасчета.СчетДоверительногоУправления);	
	ПараметрыРасчета.Вставить("ПаевойИнвестиционныйФонд",		ОбъектРасчета.ПаевойИнвестиционныйФонд);	
	ПараметрыРасчета.Вставить("Дата",							ОбъектРасчета.Дата);
	ПараметрыРасчета.Вставить("ТекущаяСЧА",						ПолучитьРасчетнуюСЧА(ОбъектРасчета, ТекущаяСЧА));
	ПараметрыРасчета.Вставить("Ссылка",							ОбъектРасчета.Ссылка);
	
	РасшифровкаРасчета = Неопределено;  
	Если ТипЗнч(ОбъектРасчета) = Тип("Структура") Тогда
		ОбъектРасчета.Свойство("РасшифровкаРасчета", РасшифровкаРасчета);
	КонецЕсли;
	
	ПакетДанныхРасчета = Справочники.БазыРасчета.РассчитатьРезервПИФПоБазеРасчета(ПараметрыРасчета, , РасшифровкаРасчета);
	
	Если ПакетДанныхРасчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПакетДанныхРасчета.Свойство("СЧАРасчетная") И ТипЗнч(ОбъектРасчета) <> Тип("Структура") Тогда 
		ОбъектРасчета.ДополнительныеСвойства.Вставить("СЧАРасчетная", ПакетДанныхРасчета.СЧАРасчетная);	
	КонецЕсли;
	
	Резервы = Новый Структура("СуммаНаВознаграждениеУправляющего, СуммаНаУслугиДепозитария, СуммаНаПрочиеРасходы", 
		ПакетДанныхРасчета.СуммаЗаВознаграждениеУправляющего, 
		ПакетДанныхРасчета.СуммаЗаВознаграждениеДепозитария, 
		ПакетДанныхРасчета.СуммаЗаПрочиеВозмещаемыеРасходыУправляющего) ;
	
	Возврат Резервы;
	
КонецФункции

Функция ПолучитьРасчетнуюСЧА(ОбъектРасчета, ТекущаяСЧА)
	
	ПредварительнаяСЧА = Неопределено;
	
	Если НачалоДня(ОбъектРасчета.Дата) = '20171229' И Не ОбъектРасчета.Организация.Код = "000000003" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = &Период
			|	И ФинансовыеПоказатели.Организация = &Организация
			|	И ФинансовыеПоказатели.СубъектАналитики = &СубъектАналитики
			|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)";
		
		Запрос.УстановитьПараметр("Организация", 		ОбъектРасчета.Организация);
		Запрос.УстановитьПараметр("Период", 			НачалоДня(ОбъектРасчета.Дата));
		Запрос.УстановитьПараметр("СубъектАналитики", 	ОбъектРасчета.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПредварительнаяСЧА = Выборка.Значение;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСЧА) Или ТекущаяСЧА = 0 Тогда 
		// Это заполнение документа
		ПредварительнаяСЧА = ТекущаяСЧА;
	Иначе
		ПредварительнаяСЧА = Документы.РегистрацияСтоимостиАктивов.ПолучитьПредварительнуюСЧА(ОбъектРасчета);
	КонецЕсли;
	
	Если ПредварительнаяСЧА = Неопределено Тогда
		ВызватьИсключение "Не определено значение СЧА на " + Формат(ОбъектРасчета.Дата, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат ПредварительнаяСЧА;
	КонецЕсли;
		
КонецФункции
